Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: وإذا انقلبوا إلى أهلهم انقلبوا فكهين
en: And when they returned to their people, they would return jesting.

source: وإذا رأوهم قالوا إن هؤلاء لضالون
en: And when they saw them, they would say, "Indeed, those are truly lost."

source: وما أرسلوا عليهم حافظين
en: But they had not been sent as guardians over them.

source: فاليوم الذين آمنوا من الكفار يضحكون
en: So Today those who believed are laughing at the disbelievers,

source: هل ثوب الكفار ما كانوا يفعلون
en: Have the disbelievers [not] been rewarded [this Day] for what they used to do?

source: إذا السماء انشقت
en: When the sky has split [open]

source: وأذنت لربها وحقت
en: And has responded to its Lord and was obligated [to do so]

source: وإذا الأرض مدت
en: And when the earth has been extended

source: وألقت ما فيها وتخلت
en: And has cast out that within it and relinquished [it]

source: يا أيها الإنسان إنك كادح إلى ربك كدحا فملاقيه
en: O mankind, indeed you are laboring toward your Lord with [great] exertion and will meet it.

source: فأما من أوتي كتابه بيمينه
en: Then as for he who is given his record in his right hand,

source: فسوف يحاسب حسابا يسيرا
en: He will be judged with an easy account

source: وينقلب إلى أهله مسرورا
en: And return to his people in happiness.

source: وأما من أوتي كتابه وراء ظهره
en: But as for he who is given his record behind his back,

source: فسوف يدعو ثبورا
en: He will cry out for destruction

source: ويصلى سعيرا
en: And [enter to] burn in a Blaze.

source: إنه كان في أهله مسرورا
en: Indeed, he had [once] been among his people in happiness;

source: إنه ظن أن لن يحور
en: Indeed, he had thought he would never return [to Allah].

source: بلى إن ربه كان به بصيرا
en: But yes! Indeed, his Lord was ever of him, Seeing.

source: فلا أقسم بالشفق
en: So I swear by the twilight glow

source: والليل وما وسق
en: And [by] the night and what it envelops

source: والقمر إذا اتسق
en: And [by] the moon when it becomes full

source: لتركبن طبقا عن طبق
en: [That] you will surely experience state after state.

source: فما لهم لا يؤمنون
en: So what is [the matter] with them [that] they do not believe,

source: وإذا قرئ عليهم القرآن لا يسجدون
en: And when the Qur'an is recited to them, they do not prostrate [to Allah]?

source: بل الذين كفروا يكذبون
en: But those who have disbelieved deny,

source: والله أعلم بما يوعون
en: And Allah is most knowing of what they keep within themselves.

source: فبشرهم بعذاب أليم
en: So give them tidings of a painful punishment,

source: إلا الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون
en: Except for those who believe and do righteous deeds. For them is a reward uninterrupted.

source: والسماء ذات البروج
en: By the sky containing great stars

source: واليوم الموعود
en: And [by] the promised Day

source: وشاهد ومشهود
en: And [by] the witness and what is witnessed,

source: قتل أصحاب الأخدود
en: Cursed were the companions of the trench

source: النار ذات الوقود
en: [Containing] the fire full of fuel,

source: إذ هم عليها قعود
en: When they were sitting near it

source: وهم على ما يفعلون بالمؤمنين شهود
en: And they, to what they were doing against the believers, were witnesses.

source: وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد
en: And they resented them not except because they believed in Allah, the Exalted in Might, the Praiseworthy,

source: الذي له ملك السماوات والأرض والله على كل شيء شهيد
en: To whom belongs the dominion of the heavens and the earth. And Allah, over all things, is Witness.

source: إن الذين فتنوا المؤمنين والمؤمنات ثم لم يتوبوا فلهم عذاب جهنم ولهم عذاب الحريق
en: Indeed, those who have tortured the believing men and believing women and then have not repented will have the punishment of Hell, and they will have the punishment of the Burning Fire.

source: إن الذين آمنوا وعملوا الصالحات لهم جنات تجري من تحتها الأنهار ذلك الفوز الكبير
en: Indeed, those who have believed and done righteous deeds will have gardens beneath which rivers flow. That is the great attainment.

source: إن بطش ربك لشديد
en: Indeed, the vengeance of your Lord is severe.

source: إنه هو يبدئ ويعيد
en: Indeed, it is He who originates [creation] and repeats.

source: وهو الغفور الودود
en: And He is the Forgiving, the Affectionate,

source: ذو العرش المجيد
en: Honorable Owner of the Throne,

source: فعال لما يريد
en: Effecter of what He intends.

source: هل أتاك حديث الجنود
en: Has there reached you the story of the soldiers -

source: فرعون وثمود
en: [Those of] Pharaoh and Thamud?

source: بل الذين كفروا في تكذيب
en: But they who disbelieve are in [persistent] denial,

source: والله من ورائهم محيط
en: While Allah encompasses them from behind.

source: بل هو قرآن مجيد
en: But this is an honored Qur'an

source: في لوح محفوظ
en: [Inscribed] in a Preserved Slate.

source: والسماء والطارق
en: By the sky and the night comer -

source: وما أدراك ما الطارق
en: And what can make you know what is the night comer?

source: النجم الثاقب
en: It is the piercing star -

source: إن كل نفس لما عليها حافظ
en: There is no soul but that it has over it a protector.

source: فلينظر الإنسان مم خلق
en: So let man observe from what he was created.

source: خلق من ماء دافق
en: He was created from a fluid, ejected,

source: يخرج من بين الصلب والترائب
en: Emerging from between the backbone and the ribs.

source: إنه على رجعه لقادر
en: Indeed, Allah, to return him [to life], is Able.

source: يوم تبلى السرائر
en: The Day when secrets will be put on trial,

source: فما له من قوة ولا ناصر
en: Then man will have no power or any helper.

source: والسماء ذات الرجع
en: By the sky which returns [rain]

source: والأرض ذات الصدع
en: And [by] the earth which cracks open,

source: إنه لقول فصل
en: Indeed, the Qur'an is a decisive statement,

source: وما هو بالهزل
en: And it is not amusement.

source: إنهم يكيدون كيدا
en: Indeed, they are planning a plan,

source: وأكيد كيدا
en: But I am planning a plan.

source: فمهل الكافرين أمهلهم رويدا
en: So allow time for the disbelievers. Leave them awhile.

source: سبح اسم ربك الأعلى
en: Exalt the name of your Lord, the Most High,

source: الذي خلق فسوى
en: Who created and proportioned

source: والذي قدر فهدى
en: And who destined and [then] guided

source: والذي أخرج المرعى
en: And who brings out the pasture

source: فجعله غثاء أحوى
en: And [then] makes it black stubble.

source: سنقرئك فلا تنسى
en: We will make you recite, [O Muhammad], and you will not forget,

source: إلا ما شاء الله إنه يعلم الجهر وما يخفى
en: Except what Allah should will. Indeed, He knows what is declared and what is hidden.

source: ونيسرك لليسرى
en: And We will ease you toward ease.

source: فذكر إن نفعت الذكرى
en: So remind, if the reminder should benefit;

source: سيذكر من يخشى
en: He who fears [Allah] will be reminded.

source: ويتجنبها الأشقى
en: But the wretched one will avoid it -

source: الذي يصلى النار الكبرى
en: [He] who will [enter and] burn in the greatest Fire,

source: ثم لا يموت فيها ولا يحيى
en: Neither dying therein nor living.

source: قد أفلح من تزكى
en: He has certainly succeeded who purifies himself

source: وذكر اسم ربه فصلى
en: And mentions the name of his Lord and prays.

source: بل تؤثرون الحياة الدنيا
en: But you prefer the worldly life,

source: والآخرة خير وأبقى
en: While the Hereafter is better and more enduring.

source: إن هذا لفي الصحف الأولى
en: Indeed, this is in the former scriptures,

source: صحف إبراهيم وموسى
en: The scriptures of Abraham and Moses.

source: هل أتاك حديث الغاشية
en: Has there reached you the report of the Overwhelming [event]?

source: وجوه يومئذ خاشعة
en: [Some] faces, that Day, will be humbled,

source: عاملة ناصبة
en: Working [hard] and exhausted.

source: تصلى نارا حامية
en: They will [enter to] burn in an intensely hot Fire.

source: تسقى من عين آنية
en: They will be given drink from a boiling spring.

source: ليس لهم طعام إلا من ضريع
en: For them there will be no food except from a poisonous, thorny plant

source: لا يسمن ولا يغني من جوع
en: Which neither nourishes nor avails against hunger.

source: وجوه يومئذ ناعمة
en: [Other] faces, that Day, will show pleasure.

source: لسعيها راضية
en: With their effort [they are] satisfied

source: لا تسمع فيها لاغية
en: Wherein they will hear no unsuitable speech.

source: فيها عين جارية
en: Within it is a flowing spring.

source: فيها سرر مرفوعة
en: Within it are couches raised high

source: وأكواب موضوعة
en: And cups put in place

source: ونمارق مصفوفة
en: And cushions lined up

source: وزرابي مبثوثة
en: And carpets spread around.

source: أفلا ينظرون إلى الإبل كيف خلقت
en: Then do they not look at the camels - how they are created?

source: وإلى السماء كيف رفعت
en: And at the sky - how it is raised?

source: وإلى الجبال كيف نصبت
en: And at the mountains - how they are erected?

source: وإلى الأرض كيف سطحت
en: And at the earth - how it is spread out?

source: فذكر إنما أنت مذكر
en: So remind, [O Muhammad]; you are only a reminder.

source: لست عليهم بمصيطر
en: You are not over them a controller.

source: إلا من تولى وكفر
en: However, he who turns away and disbelieves -

source: فيعذبه الله العذاب الأكبر
en: Then Allah will punish him with the greatest punishment.

source: إن إلينا إيابهم
en: Indeed, to Us is their return.

source: ثم إن علينا حسابهم
en: Then indeed, upon Us is their account.

source: والفجر
en: By the dawn

source: وليال عشر
en: And [by] ten nights

source: والشفع والوتر
en: And [by] the even [number] and the odd

source: والليل إذا يسر
en: And [by] the night when it passes,

source: هل في ذلك قسم لذي حجر
en: Is there [not] in [all] that an oath [sufficient] for one of perception?

source: ألم تر كيف فعل ربك بعاد
en: Have you not considered how your Lord dealt with 'Aad -

source: إرم ذات العماد
en: [With] Iram - who had lofty pillars,

source: التي لم يخلق مثلها في البلاد
en: The likes of whom had never been created in the land?

source: وثمود الذين جابوا الصخر بالواد
en: And [with] Thamud, who carved out the rocks in the valley?

source: وفرعون ذي الأوتاد
en: And [with] Pharaoh, owner of the stakes? -

source: الذين طغوا في البلاد
en: [All of] whom oppressed within the lands

source: فأكثروا فيها الفساد
en: And increased therein the corruption.

source: فصب عليهم ربك سوط عذاب
en: So your Lord poured upon them a scourge of punishment.

source: إن ربك لبالمرصاد
en: Indeed, your Lord is in observation.

source: فأما الإنسان إذا ما ابتلاه ربه فأكرمه ونعمه فيقول ربي أكرمن
en: And as for man, when his Lord tries him and [thus] is generous to him and favors him, he says, "My Lord has honored me."

source: وأما إذا ما ابتلاه فقدر عليه رزقه فيقول ربي أهانن
en: But when He tries him and restricts his provision, he says, "My Lord has humiliated me."

source: كلا بل لا تكرمون اليتيم
en: No! But you do not honor the orphan

source: ولا تحاضون على طعام المسكين
en: And you do not encourage one another to feed the poor.

source: وتأكلون التراث أكلا لما
en: And you consume inheritance, devouring [it] altogether,

source: وتحبون المال حبا جما
en: And you love wealth with immense love.

source: كلا إذا دكت الأرض دكا دكا
en: No! When the earth has been leveled - pounded and crushed -

source: وجاء ربك والملك صفا صفا
en: And your Lord has come and the angels, rank upon rank,

source: وجيء يومئذ بجهنم يومئذ يتذكر الإنسان وأنى له الذكرى
en: And brought [within view], that Day, is Hell - that Day, man will remember, but what good to him will be the remembrance?

source: يقول يا ليتني قدمت لحياتي
en: He will say, "Oh, I wish I had sent ahead [some good] for my life."

source: فيومئذ لا يعذب عذابه أحد
en: So on that Day, none will punish [as severely] as His punishment,

source: ولا يوثق وثاقه أحد
en: And none will bind [as severely] as His binding [of the evildoers].

source: يا أيتها النفس المطمئنة
en: [To the righteous it will be said], "O reassured soul,

source: ارجعي إلى ربك راضية مرضية
en: Return to your Lord, well-pleased and pleasing [to Him],

source: فادخلي في عبادي
en: And enter among My [righteous] servants

source: وادخلي جنتي
en: And enter My Paradise."

source: لا أقسم بهذا البلد
en: I swear by this city, Makkah -

source: وأنت حل بهذا البلد
en: And you, [O Muhammad], are free of restriction in this city -

source: ووالد وما ولد
en: And [by] the father and that which was born [of him],

source: لقد خلقنا الإنسان في كبد
en: We have certainly created man into hardship.

source: أيحسب أن لن يقدر عليه أحد
en: Does he think that never will anyone overcome him?

source: يقول أهلكت مالا لبدا
en: He says, "I have spent wealth in abundance."

source: أيحسب أن لم يره أحد
en: Does he think that no one has seen him?

source: ألم نجعل له عينين
en: Have We not made for him two eyes?

source: ولسانا وشفتين
en: And a tongue and two lips?

source: وهديناه النجدين
en: And have shown him the two ways?

source: فلا اقتحم العقبة
en: But he has not broken through the difficult pass.

source: وما أدراك ما العقبة
en: And what can make you know what is [breaking through] the difficult pass?

source: فك رقبة
en: It is the freeing of a slave

source: أو إطعام في يوم ذي مسغبة
en: Or feeding on a day of severe hunger

source: يتيما ذا مقربة
en: An orphan of near relationship

source: أو مسكينا ذا متربة
en: Or a needy person in misery

source: ثم كان من الذين آمنوا وتواصوا بالصبر وتواصوا بالمرحمة
en: And then being among those who believed and advised one another to patience and advised one another to compassion.

source: أولئك أصحاب الميمنة
en: Those are the companions of the right.

source: والذين كفروا بآياتنا هم أصحاب المشأمة
en: But they who disbelieved in Our signs - those are the companions of the left.

source: عليهم نار مؤصدة
en: Over them will be fire closed in.

source: والشمس وضحاها
en: By the sun and its brightness

source: والقمر إذا تلاها
en: And [by] the moon when it follows it

source: والنهار إذا جلاها
en: And [by] the day when it displays it

source: والليل إذا يغشاها
en: And [by] the night when it covers it

source: والسماء وما بناها
en: And [by] the sky and He who constructed it

source: والأرض وما طحاها
en: And [by] the earth and He who spread it

source: ونفس وما سواها
en: And [by] the soul and He who proportioned it

source: فألهمها فجورها وتقواها
en: And inspired it [with discernment of] its wickedness and its righteousness,

source: قد أفلح من زكاها
en: He has succeeded who purifies it,

source: وقد خاب من دساها
en: And he has failed who instills it [with corruption].

source: كذبت ثمود بطغواها
en: Thamud denied [their prophet] by reason of their transgression,

source: إذ انبعث أشقاها
en: When the most wretched of them was sent forth.

source: فقال لهم رسول الله ناقة الله وسقياها
en: And the messenger of Allah [Salih] said to them, "[Do not harm] the she-camel of Allah or [prevent her from] her drink."

source: فكذبوه فعقروها فدمدم عليهم ربهم بذنبهم فسواها
en: But they denied him and hamstrung her. So their Lord brought down upon them destruction for their sin and made it equal [upon all of them].

source: ولا يخاف عقباها
en: And He does not fear the consequence thereof.

source: والليل إذا يغشى
en: By the night when it covers

source: والنهار إذا تجلى
en: And [by] the day when it appears

source: وما خلق الذكر والأنثى
en: And [by] He who created the male and female,

source: إن سعيكم لشتى
en: Indeed, your efforts are diverse.

source: فأما من أعطى واتقى
en: As for he who gives and fears Allah

source: وصدق بالحسنى
en: And believes in the best [reward],

source: فسنيسره لليسرى
en: We will ease him toward ease.

source: وأما من بخل واستغنى
en: But as for he who withholds and considers himself free of need

source: وكذب بالحسنى
en: And denies the best [reward],

source: فسنيسره للعسرى
en: We will ease him toward difficulty.

source: وما يغني عنه ماله إذا تردى
en: And what will his wealth avail him when he falls?

source: إن علينا للهدى
en: Indeed, [incumbent] upon Us is guidance.

source: وإن لنا للآخرة والأولى
en: And indeed, to Us belongs the Hereafter and the first [life].

source: فأنذرتكم نارا تلظى
en: So I have warned you of a Fire which is blazing.

source: لا يصلاها إلا الأشقى
en: None will [enter to] burn therein except the most wretched one.

source: الذي كذب وتولى
en: Who had denied and turned away.

source: وسيجنبها الأتقى
en: But the righteous one will avoid it -

source: الذي يؤتي ماله يتزكى
en: [He] who gives [from] his wealth to purify himself

source: وما لأحد عنده من نعمة تجزى
en: And not [giving] for anyone who has [done him] a favor to be rewarded

source: إلا ابتغاء وجه ربه الأعلى
en: But only seeking the countenance of his Lord, Most High.

source: ولسوف يرضى
en: And he is going to be satisfied.

source: والضحى
en: By the morning brightness

source: والليل إذا سجى
en: And [by] the night when it covers with darkness,

source: ما ودعك ربك وما قلى
en: Your Lord has not taken leave of you, [O Muhammad], nor has He detested [you].

source: وللآخرة خير لك من الأولى
en: And the Hereafter is better for you than the first [life].

source: ولسوف يعطيك ربك فترضى
en: And your Lord is going to give you, and you will be satisfied.

source: ألم يجدك يتيما فآوى
en: Did He not find you an orphan and give [you] refuge?

source: ووجدك ضالا فهدى
en: And He found you lost and guided [you],

source: ووجدك عائلا فأغنى
en: And He found you poor and made [you] self-sufficient.

source: فأما اليتيم فلا تقهر
en: So as for the orphan, do not oppress [him].

source: وأما السائل فلا تنهر
en: And as for the petitioner, do not repel [him].

source: وأما بنعمة ربك فحدث
en: But as for the favor of your Lord, report [it].

source: ألم نشرح لك صدرك
en: Did We not expand for you, [O Muhammad], your breast?

source: ووضعنا عنك وزرك
en: And We removed from you your burden

source: الذي أنقض ظهرك
en: Which had weighed upon your back

source: ورفعنا لك ذكرك
en: And raised high for you your repute.

source: فإن مع العسر يسرا
en: For indeed, with hardship [will be] ease.

source: إن مع العسر يسرا
en: Indeed, with hardship [will be] ease.

source: فإذا فرغت فانصب
en: So when you have finished [your duties], then stand up [for worship].

source: وإلى ربك فارغب
en: And to your Lord direct [your] longing.

source: والتين والزيتون
en: By the fig and the olive

source: وطور سينين
en: And [by] Mount Sinai

source: وهذا البلد الأمين
en: And [by] this secure city [Makkah],

source: لقد خلقنا الإنسان في أحسن تقويم
en: We have certainly created man in the best of stature;

source: ثم رددناه أسفل سافلين
en: Then We return him to the lowest of the low,

source: إلا الذين آمنوا وعملوا الصالحات فلهم أجر غير ممنون
en: Except for those who believe and do righteous deeds, for they will have a reward uninterrupted.

source: فما يكذبك بعد بالدين
en: So what yet causes you to deny the Recompense?

source: أليس الله بأحكم الحاكمين
en: Is not Allah the most just of judges?

source: اقرأ باسم ربك الذي خلق
en: Recite in the name of your Lord who created -

source: خلق الإنسان من علق
en: Created man from a clinging substance.

source: اقرأ وربك الأكرم
en: Recite, and your Lord is the most Generous -

source: الذي علم بالقلم
en: Who taught by the pen -

source: علم الإنسان ما لم يعلم
en: Taught man that which he knew not.

source: كلا إن الإنسان ليطغى
en: No! [But] indeed, man transgresses

source: أن رآه استغنى
en: Because he sees himself self-sufficient.

source: إن إلى ربك الرجعى
en: Indeed, to your Lord is the return.

source: أرأيت الذي ينهى
en: Have you seen the one who forbids

source: عبدا إذا صلى
en: A servant when he prays?

source: أرأيت إن كان على الهدى
en: Have you seen if he is upon guidance

source: أو أمر بالتقوى
en: Or enjoins righteousness?

source: أرأيت إن كذب وتولى
en: Have you seen if he denies and turns away -

source: ألم يعلم بأن الله يرى
en: Does he not know that Allah sees?

source: كلا لئن لم ينته لنسفعا بالناصية
en: No! If he does not desist, We will surely drag him by the forelock -

source: ناصية كاذبة خاطئة
en: A lying, sinning forelock.

source: فليدع ناديه
en: Then let him call his associates;

source: سندع الزبانية
en: We will call the angels of Hell.

source: كلا لا تطعه واسجد واقترب
en: No! Do not obey him. But prostrate and draw near [to Allah].

source: إنا أنزلناه في ليلة القدر
en: Indeed, We sent the Qur'an down during the Night of Decree.

source: وما أدراك ما ليلة القدر
en: And what can make you know what is the Night of Decree?

source: ليلة القدر خير من ألف شهر
en: The Night of Decree is better than a thousand months.

source: تنزل الملائكة والروح فيها بإذن ربهم من كل أمر
en: The angels and the Spirit descend therein by permission of their Lord for every matter.

source: سلام هي حتى مطلع الفجر
en: Peace it is until the emergence of dawn.

source: لم يكن الذين كفروا من أهل الكتاب والمشركين منفكين حتى تأتيهم البينة
en: Those who disbelieved among the People of the Scripture and the polytheists were not to be parted [from misbelief] until there came to them clear evidence -

source: رسول من الله يتلو صحفا مطهرة
en: A Messenger from Allah, reciting purified scriptures

source: فيها كتب قيمة
en: Within which are correct writings.

source: وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينة
en: Nor did those who were given the Scripture become divided until after there had come to them clear evidence.

source: وما أمروا إلا ليعبدوا الله مخلصين له الدين حنفاء ويقيموا الصلاة ويؤتوا الزكاة وذلك دين القيمة
en: And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakah. And that is the correct religion.

source: إن الذين كفروا من أهل الكتاب والمشركين في نار جهنم خالدين فيها أولئك هم شر البرية
en: Indeed, they who disbelieved among the People of the Scripture and the polytheists will be in the fire of Hell, abiding eternally therein. Those are the worst of creatures.

source: إن الذين آمنوا وعملوا الصالحات أولئك هم خير البرية
en: Indeed, they who have believed and done righteous deeds - those are the best of creatures.

source: جزاؤهم عند ربهم جنات عدن تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم ورضوا عنه ذلك لمن خشي ربه
en: Their reward with Allah will be gardens of perpetual residence beneath which rivers flow, wherein they will abide forever, Allah being pleased with them and they with Him. That is for whoever has feared his Lord.

source: إذا زلزلت الأرض زلزالها
en: When the earth is shaken with its [final] earthquake

source: وأخرجت الأرض أثقالها
en: And the earth discharges its burdens

source: وقال الإنسان ما لها
en: And man says, "What is [wrong] with it?" -

source: يومئذ تحدث أخبارها
en: That Day, it will report its news

source: بأن ربك أوحى لها
en: Because your Lord has commanded it.

source: يومئذ يصدر الناس أشتاتا ليروا أعمالهم
en: That Day, the people will depart separated [into categories] to be shown [the result of] their deeds.

source: فمن يعمل مثقال ذرة خيرا يره
en: So whoever does an atom's weight of good will see it,

source: ومن يعمل مثقال ذرة شرا يره
en: And whoever does an atom's weight of evil will see it.

source: والعاديات ضبحا
en: By the racers, panting,

source: فالموريات قدحا
en: And the producers of sparks [when] striking

source: فالمغيرات صبحا
en: And the chargers at dawn,

source: فأثرن به نقعا
en: Stirring up thereby [clouds of] dust,

source: فوسطن به جمعا
en: Arriving thereby in the center collectively,

source: إن الإنسان لربه لكنود
en: Indeed mankind, to his Lord, is ungrateful.

source: وإنه على ذلك لشهيد
en: And indeed, he is to that a witness.

source: وإنه لحب الخير لشديد
en: And indeed he is, in love of wealth, intense.

source: أفلا يعلم إذا بعثر ما في القبور
en: But does he not know that when the contents of the graves are scattered

source: وحصل ما في الصدور
en: And that within the breasts is obtained,

source: إن ربهم بهم يومئذ لخبير
en: Indeed, their Lord with them, that Day, is [fully] Acquainted.

source: القارعة
en: The Striking Calamity -

source: ما القارعة
en: What is the Striking Calamity?
